In [20]:
import numpy as np
import pandas as pd
import sklearn
import matplotlib.pyplot as plt
import seaborn as sns

In [35]:
df = pd.read_csv("file_name.csv")
df.head()

              location  total_sqft  bath  price  bhk
0  1st Block Jayanagar      2850.0     4  428.0    4
1  1st Block Jayanagar      1630.0     3  194.0    3
2  1st Block Jayanagar      1875.0     2  235.0    3
3  1st Block Jayanagar      1200.0     2  130.0    3
4  1st Block Jayanagar      1235.0     2  148.0    2

In [37]:
sample_size = 5000
df = df.sample(n=sample_size, replace=False, random_state=490)

df = df.reset_index()
df = df.drop('index',axis=1)

In [38]:
df.head()

       location  total_sqft  bath  price  bhk
0   Devanahalli      1408.0     2   85.0    2
1         other       830.0     2   60.0    2
2   Koramangala      1083.0     2  100.0    2
3  Bommanahalli       910.0     2   45.0    2
4   Koramangala      1140.0     2   75.2    2